src/InformationRegisters/ГраницыСобытийПланировщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ГраницыСобытийПланировщика</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачалоНапоминаний</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеНапоминаний</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СобытияПланировщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоПовторений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОкончаниеПовторений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтатусыСобытийПланировщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтатусыСобытийПланировщика</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подтверждено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/ГраницыСобытийПланировщика/Ext/ManagerModule.bsl
Процедура ВыполнитьПроверкуГраницСобытия(СобытиеСсылка) Экспорт
	
	РеквизитыСобытия	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СобытиеСсылка, "Статус, Повторять, НачалоСобытия, ОкончаниеСобытия");
	НапоминанияСобытия	= ПланировщикДанные.ПолучитьДанныеНапоминаний(СобытиеСсылка);
	
	СдвигНапоминанийНачало	= 0;
	СдвигНапоминанийКонец	= 3 * ПланировщикКлиентСервер.МесяцВСекундах(31);
	ЕстьНапоминания			= (НапоминанияСобытия.Количество() > 0);
	Для Каждого СтрокаНапоминания Из НапоминанияСобытия Цикл
		СдвигНапоминанийНачало	= Макс(СдвигНапоминанийНачало, СтрокаНапоминания.ИнтервалСекунды);
		СдвигНапоминанийКонец	= Мин(СдвигНапоминанийКонец, СтрокаНапоминания.ИнтервалСекунды);
	КонецЦикла;
	
	НаборЗаписей = РегистрыСведений.ГраницыСобытийПланировщика.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Событие.Установить(СобытиеСсылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Если НЕ РеквизитыСобытия.Статус = Перечисления.СтатусыСобытийПланировщика.Отменено Тогда
		Если НЕ РеквизитыСобытия.Повторять Тогда
			НачалоПовторений	= НачалоДня(РеквизитыСобытия.НачалоСобытия);
			ОкончаниеПовторений	= НачалоДня(РеквизитыСобытия.ОкончаниеСобытия);
		Иначе 
			НачалоПовторений	= РеквизитыСобытия.ПовторНачало;
			ОкончаниеПовторений = ПланировщикДанные.РассчитатьКонецПериодаПовторений(РеквизитыСобытия.Ссылка);
		КонецЕсли;
		СдвигСНачалаДня = РеквизитыСобытия.НачалоСобытия - НачалоДня(РеквизитыСобытия.НачалоСобытия);
		
		ЗаписьРегистра = НаборЗаписей.Добавить();
		ЗаписьРегистра.Событие				= СобытиеСсылка;
		ЗаписьРегистра.НачалоПовторений		= НачалоПовторений;
		ЗаписьРегистра.ОкончаниеПовторений	= ОкончаниеПовторений;
		ЗаписьРегистра.НачалоНапоминаний	= ?(НЕ ЕстьНапоминания, Дата(1, 1, 1), НачалоПовторений + СдвигСНачалаДня - СдвигНапоминанийНачало);
		ЗаписьРегистра.ОкончаниеНапоминаний	= ?(НЕ ЕстьНапоминания, Дата(1, 1, 1), ОкончаниеПовторений + СдвигСНачалаДня - СдвигНапоминанийКонец);
	КонецЕсли;
	
	НаборЗаписей.Записать();
			
КонецПроцедуры
